sensorOpt/0deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          300;
        startFace       89550;
    }
    right
    {
        type            patch;
        nFaces          150;
        startFace       89850;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          300;
        startFace       90000;
    }
    left
    {
        type            patch;
        nFaces          150;
        startFace       90300;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          45000;
        startFace       90450;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          45000;
        startFace       135450;
    }
)

// ************************************************************************* //
